IDENTIFICATION DIVISION.
PROGRAM-ID. SUBTRACT-NUMBERS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A            PIC 9(3) VALUE 100.
01 B            PIC 9(3) VALUE 35.
01 DIFFERENCE   PIC 9(4).

PROCEDURE DIVISION.
    COMPUTE DIFFERENCE = A - B
    DISPLAY A " minus " B " equals " DIFFERENCE
    STOP RUN.
